<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"3dd4a6aa65ca04dc24e0fe3632a89184a0d38dbbe922033e825082c644b178e8","plan_job_ref":"Job PR Plan #4 at https://github.com/mpsamuels/mpsamuels_website/actions/runs/12738016145","plan_out_hash":"3ec055c34e8274c809ac6d0809c89adb2fd94ad37361050a66d13ddb817447c3","plan_hash":"41b532e56042077860bde2f3a0716c9adb36e0855a773dd2f2241086c60a515f","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __./terraform/s3_website__ in the __prod__ workspace
<details>
<summary>Plan: 6 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.root_s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "root_s3_distribution" {
        id                             = "E2BLM2GJT7D1R1"
        tags                           = {}
+       web_acl_id                     = (known after apply)
#        (19 unchanged attributes hidden)

!~      default_cache_behavior {
!~          viewer_protocol_policy     = "allow-all" -> "redirect-to-https"
#            (15 unchanged attributes hidden)

#            (1 unchanged block hidden)
        }

+       logging_config {
+           bucket          = "logs.mps-website-website-bucket.s3.amazonaws.com"
+           include_cookies = false
+           prefix          = "root"
        }

!~      restrictions {
!~          geo_restriction {
!~              locations        = [
+                   "RUS",
                ]
!~              restriction_type = "none" -> "blacklist"
            }
        }

#        (2 unchanged blocks hidden)
    }

  # aws_cloudfront_distribution.www_s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "www_s3_distribution" {
        id                             = "E17HAQKNAVEFRQ"
        tags                           = {}
+       web_acl_id                     = (known after apply)
#        (19 unchanged attributes hidden)

+       logging_config {
+           bucket          = "logs.mps-website-website-bucket.s3.amazonaws.com"
+           include_cookies = false
+           prefix          = "www"
        }

!~      restrictions {
!~          geo_restriction {
!~              locations        = [
+                   "RUS",
                ]
!~              restriction_type = "none" -> "blacklist"
            }
        }

#        (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.log_bucket will be created
+   resource "aws_s3_bucket" "log_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "log.mps-website-website-bucket"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # aws_s3_bucket_acl.log_bucket_acl will be created
+   resource "aws_s3_bucket_acl" "log_bucket_acl" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)

+       access_control_policy (known after apply)
    }

  # aws_s3_bucket_ownership_controls.log_bucket_acl_ownership will be created
+   resource "aws_s3_bucket_ownership_controls" "log_bucket_acl_ownership" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           object_ownership = "ObjectWriter"
        }
    }

  # aws_s3_bucket_policy.log_bucket_policy will be created
+   resource "aws_s3_bucket_policy" "log_bucket_policy" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = jsonencode(
            {
+               Id        = "PolicyForCloudFrontPrivateContent"
+               Statement = [
+                   {
+                       Action    = "s3:GetObject"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "cloudfront.amazonaws.com"
                        }
+                       Resource  = "arn:aws:s3:::logs.mps-website-website-bucket/*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_bucket_public_access_block.log_bucket_public_block will be created
+   resource "aws_s3_bucket_public_access_block" "log_bucket_public_block" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # aws_wafv2_web_acl.website_waf will be created
+   resource "aws_wafv2_web_acl" "website_waf" {
+       arn        = (known after apply)
+       capacity   = (known after apply)
+       id         = (known after apply)
+       lock_token = (known after apply)
+       name       = "rate-based-waf"
+       scope      = "CLOUDFRONT"
+       tags_all   = (known after apply)

+       default_action {
+           allow {
            }
        }

+       rule {
+           name     = "rate-rule"
+           priority = 1

+           action {
+               block {
                }
            }

+           statement {
+               rate_based_statement {
+                   aggregate_key_type = "**"
+                   limit              = 1000
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = true
+               metric_name                = "rate-rule-metric"
+               sampled_requests_enabled   = false
            }
        }

+       visibility_config {
+           cloudwatch_metrics_enabled = true
+           metric_name                = "default-metric-name"
+           sampled_requests_enabled   = false
        }
    }

Plan: 6 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [PR Plan #4](https://github.com/mpsamuels/mpsamuels_website/actions/runs/12738016145)